In [2]:
import pandas as pd

In [5]:
data = {
    "class": ["A", "A", "B", "B"],
    "name": ["철수", "영희", "민수", "지수"],
    "score": [80, 90, 70, 85]
}

#dataframe으로 변환
df = pd.DataFrame(data)
df

  class name  score
0     A   철수     80
1     A   영희     90
2     B   민수     70
3     B   지수     85

In [12]:
#group by 객체생성
df.groupby("class")

for key,value in df.groupby("class"):
    print(key)
    print(value)

A
  class name  score
0     A   철수     80
1     A   영희     90
B
  class name  score
2     B   민수     70
3     B   지수     85

In [13]:
print(df.groupby("class")["score"].mean())

class
A    85.0
B    77.5
Name: score, dtype: float64

### SQL
'''
SELECT class, COUNT(*) AS cnt, AVG(score) AS avg_score
FROM df
WHERE score >= 70
GROUP BY class
HAVING AVG(score) >= 80
ORDER BY avg_score DESC
LIMIT 3;
'''

In [15]:
data1 = {
    '학급': ['A', 'A', 'B', 'B', 'C', 'C'],
    '이름': ['철수', '영희', '민수', '수진', '지훈', '혜진'],
    '수학': [90, 80, 70, 85, 60, 95],
    '영어': [85, 88, 75, 70, 95, 90]
}

df1 = pd.DataFrame(data1)
df1

  학급  이름  수학  영어
0  A  철수  90  85
1  A  영희  80  88
2  B  민수  70  75
3  B  수진  85  70
4  C  지훈  60  95
5  C  혜진  95  90

In [ ]:
#학급별 수학,영어점수평균, 인덱스 추가
df1_mean = df1.groupby("학급")[["수학","영어"]].mean().reset_index()
#df1_mean = df1.groupby("학급")[["수학","영어"]].mean().reset_index(drop=True)

In [26]:
print(df1_mean)
print(df1_mean.shape)

  학급    수학    영어
0  A  85.0  86.5
1  B  77.5  72.5
2  C  77.5  92.5
(3, 3)

In [ ]:
df2_mean = df1.groupby("학급")[["수학","영어"]].mean()
df2_mean

      수학    영어
학급
A   85.0  86.5
B   77.5  72.5
C   77.5  92.5

In [ ]:
df2_mean.shape
# 2차원 (행,열) (3,2) 인덱스가 학급임

(3, 2)

In [28]:
df1.groupby("학급")["수학"].agg(['mean','max','count'])

    mean  max  count
학급
A   85.0   90      2
B   77.5   85      2
C   77.5   95      2

In [29]:
df1

  학급  이름  수학  영어
0  A  철수  90  85
1  A  영희  80  88
2  B  민수  70  75
3  B  수진  85  70
4  C  지훈  60  95
5  C  혜진  95  90

In [30]:
#수학값의 평균
df1["수학"].mean()

np.float64(80.0)

In [31]:
df1.describe()

              수학         영어
count   6.000000   6.000000
mean   80.000000  83.833333
std    13.038405   9.495613
min    60.000000  70.000000
25%    72.500000  77.500000
50%    82.500000  86.500000
75%    88.750000  89.500000
max    95.000000  95.000000

In [33]:
df1.groupby("학급")["수학"].describe()

    count  mean        std   min    25%   50%    75%   max
학급
A     2.0  85.0   7.071068  80.0  82.50  85.0  87.50  90.0
B     2.0  77.5  10.606602  70.0  73.75  77.5  81.25  85.0
C     2.0  77.5  24.748737  60.0  68.75  77.5  86.25  95.0

In [ ]:
#df1_mean = df1.groupby("학급")[["수학","영어"]].mean().reset_index()
#df1_mean
df1.groupby("학급").agg(수학평균=("수학","mean"), 영어평균=("영어","mean"))

    수학평균  영어평균
학급
A   85.0  86.5
B   77.5  72.5
C   77.5  92.5

In [43]:
df1_mean

  학급    수학    영어
0  A  85.0  86.5
1  B  77.5  72.5
2  C  77.5  92.5

In [ ]:
# titanic.csv이용 agg
tdf = pd.read_csv("data/titanic.csv")
tdf.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [46]:
tdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [50]:
tdf.sort_values(by=["pclass", "sex"], ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [53]:
tdf.shape
tdf.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [57]:
tdf[["age","fare"]].mean()

age     29.699118
fare    32.204208
dtype: float64

In [59]:
tdf[["age","fare"]].sum()

age     21205.1700
fare    28693.9493
dtype: float64

In [60]:
tdf.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [61]:
tdf[["age","survived","fare"]].describe()

              age    survived        fare
count  714.000000  891.000000  891.000000
mean    29.699118    0.383838   32.204208
std     14.526497    0.486592   49.693429
min      0.420000    0.000000    0.000000
25%     20.125000    0.000000    7.910400
50%     28.000000    0.000000   14.454200
75%     38.000000    1.000000   31.000000
max     80.000000    1.000000  512.329200

In [63]:
tg = tdf.groupby("pclass")

In [69]:
tg[["age", "fare"]].count()

        age  fare
pclass
1       186   216
2       173   184
3       355   491

In [70]:
tg.count()

,survived,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
pclass,,,,,,,,,,,,,,
1,216,216,186,216,216,216,214,216,216,216,175,214,216,216
2,184,184,173,184,184,184,184,184,184,184,16,184,184,184
3,491,491,355,491,491,491,491,491,491,491,12,491,491,491

In [78]:
tg['survived'].agg({'count', 'sum'})

        count  sum
pclass
1         216  136
2         184   87
3         491  119